# YOLOv5 nano-smaller.yaml
# Ultralytics YOLOv5 🚀, AGPL-3.0 license

# Parameters
nc: 80 # number of classes
depth_multiple: 0.2 # further reduced model depth
width_multiple: 0.2 # further reduced layer channel

anchors:
  - [10, 13, 16, 30, 33, 23] # P3/8
  - [30, 61, 62, 45, 59, 119] # P4/16
  - [116, 90, 156, 198, 373, 326] # P5/32

# YOLOv5 nano-smaller backbone
backbone: [
    [-1, 1, Conv, [32, 3, 2]], # 0-P1/2
    [-1, 1, Conv, [64, 3, 2]], # 1-P2/4
    [-1, 2, C3, [64]], # Reduced number of C3 layers
    [-1, 1, Conv, [128, 3, 2]], # 3-P3/8
    [-1, 3, C3, [128]], # Reduced number of C3 layers
    [-1, 1, Conv, [256, 3, 2]], # 5-P4/16
    [-1, 3, C3, [256]], # Reduced number of C3 layers
    [-1, 1, Conv, [512, 3, 2]], # 7-P5/32
    [-1, 1, SPPF, [512, 5]], # Reduced SPPF layer channels
  ]

# YOLOv5 nano-smaller head
head: [
    [-1, 1, Conv, [256, 1, 1]], # Reduced channels
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 5], 1, Concat, [1]], # cat backbone P4 - corrected from `6` to `5`
    [-1, 2, C3, [256, False]], # Reduced number of C3 layers

    [-1, 1, Conv, [128, 1, 1]], # Reduced channels
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 3], 1, Concat, [1]], # cat backbone P3 - corrected from `4` to `3`
    [-1, 2, C3, [128, False]], # Reduced number of C3 layers

    [-1, 1, Conv, [128, 3, 2]],
    [[-1, 10], 1, Concat, [1]], # cat head P4 - corrected from `14` to `10`
    [-1, 2, C3, [256, False]], # Reduced number of C3 layers

    [-1, 1, Conv, [256, 3, 2]],
    [[-1, 7], 1, Concat, [1]], # cat head P5 - corrected from `10` to `7`
    [-1, 2, C3, [512, False]], # Reduced number of C3 layers

    [[13, 16, 19], 1, Detect, [nc, anchors]], # Detect(P3, P4, P5) - corrected indices
  ]
